### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/vpc`

✅ **Plan Status:** Success
✅ **Format Check:** Passed

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m22:41:15.969[0m [0;37mSTDOUT[0m [0;36mterraform: [0mAcquiring state lock. This may take a few moments...
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_vpc.this[0]: Refreshing state... [id=vpc-0ec326654f50eda40]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_default_network_acl.this[0]: Refreshing state... [id=acl-00c0248ec6d797c52]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_default_security_group.this[0]: Refreshing state... [id=sg-0cc8af9861f76e9cc]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_subnet.public[1]: Refreshing state... [id=subnet-0c16c6ebd3b15ede5]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_default_route_table.default[0]: Refreshing state... [id=rtb-0a4f41a95b6cc7650]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_subnet.public[0]: Refreshing state... [id=subnet-0916e127c2f8ffe79]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_internet_gateway.this[0]: Refreshing state... [id=igw-0d7fa424d242f21dc]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table.public[0]: Refreshing state... [id=rtb-06a8e3ef31fb3b4e5]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table.private[0]: Refreshing state... [id=rtb-0a3fb2979f816b446]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_subnet.private[1]: Refreshing state... [id=subnet-0daf556ea4560829f]
[0;90m22:41:15.970[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_subnet.private[0]: Refreshing state... [id=subnet-05a6485451d118f19]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_eip.nat[0]: Refreshing state... [id=eipalloc-0dbbbd01faa5941bf]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06a8e3ef31fb3b4e51080289494]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f1577f879e78d90a]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cc8b49d82ae2695e]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c58b20a157df316a]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0cf2e674f3307f2cc]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_nat_gateway.this[0]: Refreshing state... [id=nat-09f567aad97fe9b99]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3fb2979f816b4461080289494]
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ update in-place
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ destroy and then create replacement
[0;90m22:41:15.971[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_network_acl.this[0] must be replaced
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_default_network_acl" "this" {
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                    = "arn:aws:ec2:eu-south-2:743199288519:network-acl/acl-00c0248ec6d797c52" -> (known after apply)
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ default_network_acl_id = "acl-00c0248ec6d797c52" -> (known after apply) # forces replacement
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                     = "acl-00c0248ec6d797c52" -> (known after apply)
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id               = "743199288519" -> (known after apply)
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - subnet_ids             = [
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-05a6485451d118f19",
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-0916e127c2f8ffe79",
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-0c16c6ebd3b15ede5",
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - "subnet-0daf556ea4560829f",
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> null
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                   = {
[0;90m22:41:15.972[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all               = {
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.973[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                 = "vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged attribute hidden)
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - egress {
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - action          = "allow" -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - from_port       = 0 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_code       = 0 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_type       = 0 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - ipv6_cidr_block = "::/0" -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - protocol        = "-1" -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - rule_no         = 101 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - to_port         = 0 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - egress {
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - action          = "allow" -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - cidr_block      = "0.0.0.0/0" -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - from_port       = 0 -> null
[0;90m22:41:15.974[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_code       = 0 -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_type       = 0 -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - protocol        = "-1" -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - rule_no         = 100 -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - to_port         = 0 -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress {
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_cidr_block = "::/0"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 101
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress {
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + cidr_block      = "0.0.0.0/0"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 100
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - ingress {
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - action          = "allow" -> null
[0;90m22:41:15.975[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - from_port       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_code       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_type       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - ipv6_cidr_block = "::/0" -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - protocol        = "-1" -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - rule_no         = 101 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - to_port         = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - ingress {
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - action          = "allow" -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - cidr_block      = "0.0.0.0/0" -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - from_port       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_code       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - icmp_type       = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - protocol        = "-1" -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - rule_no         = 100 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - to_port         = 0 -> null
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress {
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_cidr_block = "::/0"
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 101
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.976[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress {
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + action          = "allow"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + cidr_block      = "0.0.0.0/0"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + from_port       = 0
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol        = "-1"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + rule_no         = 100
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + to_port         = 0
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged attribute hidden)
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_route_table.default[0] must be replaced
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_default_route_table" "default" {
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                    = "arn:aws:ec2:eu-south-2:743199288519:route-table/rtb-0a4f41a95b6cc7650" -> (known after apply)
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ default_route_table_id = "rtb-0a4f41a95b6cc7650" -> (known after apply) # forces replacement
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                     = "rtb-0a4f41a95b6cc7650" -> (known after apply)
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id               = "743199288519" -> (known after apply)
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - propagating_vgws       = [] -> null
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route                  = [] -> (known after apply)
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                   = {
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.977[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all               = {
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                 = "vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged attribute hidden)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged block hidden)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_default_security_group.this[0] must be replaced
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_default_security_group" "this" {
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                    = "arn:aws:ec2:eu-south-2:743199288519:security-group/sg-0cc8af9861f76e9cc" -> (known after apply)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ description            = "default VPC security group" -> (known after apply)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ egress                 = [] -> (known after apply)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                     = "sg-0cc8af9861f76e9cc" -> (known after apply)
[0;90m22:41:15.978[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ ingress                = [] -> (known after apply)
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ name                   = "default" -> (known after apply)
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id               = "743199288519" -> (known after apply)
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                   = {
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-default"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all               = {
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.979[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                 = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_eip.nat[0] will be updated in-place
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_eip" "nat" {
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id                       = "eipalloc-0dbbbd01faa5941bf"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                     = {
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                 = {
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (17 unchanged attributes hidden)
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_internet_gateway.this[0] will be updated in-place
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_internet_gateway" "this" {
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id       = "igw-0d7fa424d242f21dc"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags     = {
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.980[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all = {
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id   = "vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (3 unchanged attributes hidden)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_nat_gateway.this[0] must be replaced
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_nat_gateway" "this" {
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ association_id                     = "eipassoc-011aca7c0219b9170" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_provision_zones               = (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_scaling_ips                   = (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_mode                  = "zonal" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                 = "nat-09f567aad97fe9b99" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ network_interface_id               = "eni-01548baac45b49402" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_ip                         = "10.99.101.25" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ public_ip                          = "35.42.128.178" -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ regional_nat_gateway_address       = [] -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + regional_nat_gateway_auto_mode     = (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + route_table_id                     = (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ secondary_allocation_ids           = [] -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ secondary_private_ip_address_count = 0 -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ secondary_private_ip_addresses     = [] -> (known after apply)
[0;90m22:41:15.981[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id                          = "subnet-0916e127c2f8ffe79" -> (known after apply) # forces replacement
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                               = {
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-eu-south-2a"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                           = {
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                             = "vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (3 unchanged attributes hidden)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route.private_nat_gateway[0] must be replaced
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route" "private_nat_gateway" {
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                          = "r-rtb-0a3fb2979f816b4461080289494" -> (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_id                 = (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_owner_id           = (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ nat_gateway_id              = "nat-09f567aad97fe9b99" -> (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface_id        = (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ origin                      = "CreateRoute" -> (known after apply)
[0;90m22:41:15.982[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id              = "rtb-0a3fb2979f816b446" -> (known after apply) # forces replacement
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ state                       = "active" -> (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (12 unchanged attributes hidden)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged block hidden)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route.public_internet_gateway[0] must be replaced
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route" "public_internet_gateway" {
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                          = "r-rtb-06a8e3ef31fb3b4e51080289494" -> (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_id                 = (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_owner_id           = (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + network_interface_id        = (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ origin                      = "CreateRoute" -> (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id              = "rtb-06a8e3ef31fb3b4e5" -> (known after apply) # forces replacement
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ state                       = "active" -> (known after apply)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (13 unchanged attributes hidden)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged block hidden)
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.983[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table.private[0] must be replaced
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table" "private" {
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn              = "arn:aws:ec2:eu-south-2:743199288519:route-table/rtb-0a3fb2979f816b446" -> (known after apply)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id               = "rtb-0a3fb2979f816b446" -> (known after apply)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id         = "743199288519" -> (known after apply)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ propagating_vgws = [] -> (known after apply)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route            = [
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - {
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - cidr_block                 = "0.0.0.0/0"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - nat_gateway_id             = "nat-09f567aad97fe9b99"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (11 unchanged attributes hidden)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> (known after apply)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags             = {
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-private"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all         = {
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id           = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged attribute hidden)
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table.public[0] must be replaced
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table" "public" {
[0;90m22:41:15.984[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn              = "arn:aws:ec2:eu-south-2:743199288519:route-table/rtb-06a8e3ef31fb3b4e5" -> (known after apply)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id               = "rtb-06a8e3ef31fb3b4e5" -> (known after apply)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id         = "743199288519" -> (known after apply)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ propagating_vgws = [] -> (known after apply)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route            = [
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - {
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - cidr_block                 = "0.0.0.0/0"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - gateway_id                 = "igw-0d7fa424d242f21dc"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (11 unchanged attributes hidden)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ] -> (known after apply)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags             = {
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-public"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all         = {
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id           = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (1 unchanged attribute hidden)
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.985[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.private[0] must be replaced
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table_association" "private" {
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id             = "rtbassoc-0cf2e674f3307f2cc" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id = "rtb-0a3fb2979f816b446" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id      = "subnet-05a6485451d118f19" -> (known after apply) # forces replacement
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.private[1] must be replaced
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table_association" "private" {
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id             = "rtbassoc-0c58b20a157df316a" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id = "rtb-0a3fb2979f816b446" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id      = "subnet-0daf556ea4560829f" -> (known after apply) # forces replacement
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.public[0] must be replaced
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table_association" "public" {
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id             = "rtbassoc-0cc8b49d82ae2695e" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id = "rtb-06a8e3ef31fb3b4e5" -> (known after apply)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id      = "subnet-0916e127c2f8ffe79" -> (known after apply) # forces replacement
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.986[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route_table_association.public[1] must be replaced
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_route_table_association" "public" {
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id             = "rtbassoc-0f1577f879e78d90a" -> (known after apply)
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ route_table_id = "rtb-06a8e3ef31fb3b4e5" -> (known after apply)
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ subnet_id      = "subnet-0c16c6ebd3b15ede5" -> (known after apply) # forces replacement
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (2 unchanged attributes hidden)
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.private[0] must be replaced
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_subnet" "private" {
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                            = "arn:aws:ec2:eu-south-2:743199288519:subnet/subnet-05a6485451d118f19" -> (known after apply)
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_zone_id                           = "eus2-az1" -> (known after apply)
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                                     = "10.99.1.0/24" -> "10.10.1.0/24" # forces replacement
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - enable_lni_at_device_index                     = 0 -> null
[0;90m22:41:15.987[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                             = "subnet-05a6485451d118f19" -> (known after apply)
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - map_customer_owned_ip_on_launch                = false -> null
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                                       = "743199288519" -> (known after apply)
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                           = {
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2a"
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.988[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                                       = {
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                                         = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (10 unchanged attributes hidden)
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.private[1] must be replaced
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_subnet" "private" {
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                            = "arn:aws:ec2:eu-south-2:743199288519:subnet/subnet-0daf556ea4560829f" -> (known after apply)
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_zone_id                           = "eus2-az2" -> (known after apply)
[0;90m22:41:15.989[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                                     = "10.99.2.0/24" -> "10.10.2.0/24" # forces replacement
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - enable_lni_at_device_index                     = 0 -> null
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                             = "subnet-0daf556ea4560829f" -> (known after apply)
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - map_customer_owned_ip_on_launch                = false -> null
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                                       = "743199288519" -> (known after apply)
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                           = {
[0;90m22:41:15.990[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-private-eu-south-2b"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                                       = {
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                                         = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (10 unchanged attributes hidden)
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.991[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.public[0] must be replaced
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_subnet" "public" {
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                            = "arn:aws:ec2:eu-south-2:743199288519:subnet/subnet-0916e127c2f8ffe79" -> (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_zone_id                           = "eus2-az1" -> (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                                     = "10.99.101.0/24" -> "10.10.101.0/24" # forces replacement
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - enable_lni_at_device_index                     = 0 -> null
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                             = "subnet-0916e127c2f8ffe79" -> (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - map_customer_owned_ip_on_launch                = false -> null
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                                       = "743199288519" -> (known after apply)
[0;90m22:41:15.992[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                           = {
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2a"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                                       = {
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                                         = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (10 unchanged attributes hidden)
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_subnet.public[1] must be replaced
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_subnet" "public" {
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                            = "arn:aws:ec2:eu-south-2:743199288519:subnet/subnet-0c16c6ebd3b15ede5" -> (known after apply)
[0;90m22:41:15.993[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ availability_zone_id                           = "eus2-az2" -> (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                                     = "10.99.102.0/24" -> "10.10.102.0/24" # forces replacement
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - enable_lni_at_device_index                     = 0 -> null
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                             = "subnet-0c16c6ebd3b15ede5" -> (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                                = (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - map_customer_owned_ip_on_launch                = false -> null
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                                       = "743199288519" -> (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                           = {
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2-public-eu-south-2b"
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.994[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.995[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                                       = {
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (9 unchanged elements hidden)
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ vpc_id                                         = "vpc-0ec326654f50eda40" -> (known after apply) # forces replacement
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (10 unchanged attributes hidden)
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_vpc.this[0] must be replaced
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m-/+ resource "aws_vpc" "this" {
[0;90m22:41:15.996[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ arn                                  = "arn:aws:ec2:eu-south-2:743199288519:vpc/vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - assign_generated_ipv6_cidr_block     = false -> null
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ cidr_block                           = "10.99.0.0/16" -> "10.10.0.0/16" # forces replacement
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ default_network_acl_id               = "acl-00c0248ec6d797c52" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ default_route_table_id               = "rtb-0a4f41a95b6cc7650" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ default_security_group_id            = "sg-0cc8af9861f76e9cc" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ dhcp_options_id                      = "dopt-0e7b076f7a3fedabb" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ enable_network_address_usage_metrics = false -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id                                   = "vpc-0ec326654f50eda40" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_association_id                  = (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block                      = (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ipv6_cidr_block_network_border_group = (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      - ipv6_netmask_length                  = 0 -> null
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ main_route_table_id                  = "rtb-0a4f41a95b6cc7650" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ owner_id                             = "743199288519" -> (known after apply)
[0;90m22:41:15.997[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                                 = {
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "Name"        = "vpc-hands-on-datadog-eu-south-2"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "created-by"  = "github-actions"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "environment" = "labs"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "is-lab"      = "true"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "lab-name"    = "hands-on-datadog"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "owner"       = "dfbx"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "ttl"         = "7d"
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:41:15.998[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ tags_all                             = {
[0;90m22:41:15.

... (truncated)
```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22646060803)*